## 2.7: Rekenen
<p>
Je kunt in SQL berekeningen uitvoeren met waarden uit kolommen.  Dit doe je met `+`, `-`, `*`, `/` in de `SELECT`-statement.
</p>


| **Symbool** | **Betekenis**             | **Voorbeeld**                         | Uitleg                                |
|---------|------------------------|-----------------------------------|----------------------------------------|
| `+`     | Optellen               | `basisprijs + 1.00`               | Tel 1 euro bij de basisprijs op        |
| `-`     | Aftrekken              | `basisprijs - 0.50`               | Trek 50 cent van de basisprijs af      |
| `*`     | Vermenigvuldigen       | `basisprijs * 2`                  | Verdubbel de prijs                     |
| `/`     | Delen                  | `basisprijs / 2`                  | Deel de prijs door twee                |


<p>
<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="65%">
<p>Voorbeeld. De query hieronder telt bij de <b>basisprijs</b> een prijsverhoging van €1,00.</p>

```sql
SELECT naam, basisprijs + 1.00 AS totaalprijs
FROM pizza;
```
</td><td width="35%">


<table border="1">
  <thead>
    <tr>
      <th>naam</th>
      <th>basisprijs</th>
      <th>totaalprijs</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Margherita</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <td>Napoletana</td>
      <td>7.5</td>
      <td>8.5</td>
    </tr>
    <tr>
      <td>Prosciutto</td>
      <td>7.5</td>
      <td>8.5</td>
    </tr>
    <tr>
      <td colspan="3" style="text-align:center;">...</td>
    </tr>
    <tr>
      <td>Combinazione</td>
      <td>10.5</td>
      <td>11.5</td>
    </tr>
  </tbody>
</table>


</td></tr></table>
</p>

### Verwerkingsopdracht 2.7.1 Prijs met bezorgkosten


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="65%">

Toon per pizza de basisprijs, een bezorgtoeslag van €0,50, en het totaalbedrag.
</td><td width="35%">

<table border="1">
  <thead>
    <tr>
      <th>naam</th>
      <th>basisprijs</th>
      <th>totaalprijs</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Margherita</td>
      <td>6</td>
      <td>6.5</td>
    </tr>
    <tr>
      <td>Napoletana</td>
      <td>7.5</td>
      <td>8</td>
    </tr>
    <tr>
      <td>Prosciutto</td>
      <td>7.5</td>
      <td>8</td>
    </tr>
    <tr>
      <td colspan="3" style="text-align:center;">...</td>
    </tr>
    <tr>
      <td>Combinazione</td>
      <td>10.5</td>
      <td>11</td>
    </tr>
  </tbody>
</table>

</td></tr></table>


<p>Bekijk <a
href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave271"
target="_blank">hier</a> de voorbeelduitwerking.</p>
 <!-- ANTWOORD:
<pre><code class="language-sql"> 
SELECT naam, basisprijs, basisprijs + 0.50 AS totaalprijs
FROM pizza;
</code></pre>
-->


### Verwerkingsopdracht 2.7.2 Totaalprijs per bestelling 

<p>Stel dat elke pizza €8,00 kost (ongeacht het soort of formaat). We willen de totaalprijs per bestelling zien.</p>


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="65%">
Toon een overzicht zoals hiernaast, met per bestelling het <b>aantal</b> (uit tabel <i>besteldePizza</i>) en de berekende <b>totaalprijs</b>, waarbij je het aantal vermenigvuldigt met 8.00.
</td><td width="35%">
<table border="1">
  <thead>
    <tr>
      <th>aantal</th>
      <th>totaalprijs</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>1</td><td>8</td></tr>
    <tr><td>1</td><td>8</td></tr>
    <tr><td>1</td><td>8</td></tr>
    <tr><td>3</td><td>24</td></tr>
    <tr><td>2</td><td>16</td></tr>
    <tr><td colspan="2" style="text-align:center;">...</td></tr>
    <tr><td>1</td><td>8</td></tr>
  </tbody>
</table>

</td></tr></table>



<p>Bekijk <a
href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave272"
target="_blank">hier</a> de voorbeelduitwerking.</p>
 <!-- ANTWOORD:
<pre><code class="language-sql"> 
SELECT 
  aantal,
  aantal * 8.00 AS totaalprijs
FROM besteldePizza;
</code></pre>
-->